Revit 2026 API

# MetallicPaintMetallicpaintTopcoat Property

---

The property labeled "Top Coat" from the "MetallicPaint" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string MetallicpaintTopcoat { get; }
```
```vb
Public Shared ReadOnly Property MetallicpaintTopcoat As String
	Get
```
```cpp
public:
static property String^ MetallicpaintTopcoat {
	String^ get ();
}
```
```fsharp
static member MetallicpaintTopcoat : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetallicpaintTopcoatType".

#### Reference

MetallicPaint Class

Autodesk.Revit.DB.Visual Namespace